#fire BN

[net]
batch=64
subdivisions=8
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

#loss降不下来 学习率变大尝试
learning_rate=0.0005
max_batches = 300200
policy=steps
steps=-1,100,20000,30000
scales=.1,10,.1,.1
burn_in=1000



[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2


[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128 
size=3
stride=1
pad=1
activation=leaky

#0620fine的位置
[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256 
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

#
###############################

#fire 1  512
[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 1_end

#dense 1
[dense]

#fire 2  512
[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 2_end

#dense 2
[dense]

#fire 3  512
[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 3_end

#dense 3
[dense]

#fire 4  512
[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 4_end

#dense 4
[dense]

#fire 5  512
[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 5_end


#fine_grained inception4分支综合后？还是3×3后（和火层保持一致）？
[pass_through0]

[convolutional]
batch_normalize=1
size=1
stride=1
pad=1
filters=64
activation=leaky

[reorg]
stride=2

[pass_through1]
##fine_grained_end
###########

#fire 6  1024
[convolutional]
filters=64
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 6_end

#dense 6
[dense]

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear


[yolo]
mask = 3,4,5
anchors =  10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=20
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1

[pass_through2]

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[upsample]
stride=2


[pass_through3]

#fire 7  256
[convolutional]
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 7_end

#dense 7
[dense]

#fire 8  256
[convolutional]
filters=32
size=1
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

[get_squeeze]

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[merge_expand]
#fire 8_end

#dense 8
[dense]

[convolutional]
size=1
stride=1
pad=1
filters=75
activation=linear

[yolo]
mask = 1,2,3
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=20
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
